---
kind: property
id: P:Autodesk.Revit.DB.Settings.TilePatterns
source: html/42ea5612-6dbf-657a-b8b9-6cb64bdd5ff2.htm
---
# Autodesk.Revit.DB.Settings.TilePatterns Property

Retrieves an object that provides access to the TilePattern objects in
the document.

## Syntax (C#)
```csharp
public TilePatterns TilePatterns { get; }
```